---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStairsAutomaticLevelLandingsDeleted
source: html/c38f8776-b1c2-fe62-325e-5a2294bf4e77.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryStairsAutomaticLevelLandingsDeleted Property

Level landings are deleted because the connected stairs have been regenerated.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultistoryStairsAutomaticLevelLandingsDeleted { get; }
```